Reports/ВаловаяПрибыльУправленческая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВаловаяПрибыльУправленческая</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПересчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаТекущая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХранения</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСписанныхТоваров</Name>
					<Comment>Индекс строки списанных товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ВаловаяПрибыльУправленческая/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	//УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Проект КАК Проект,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Покупатель КАК Покупатель,
	|	ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Проект) КАК ПроектПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение) КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Покупатель) КАК ПокупательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ДоговорПокупателя) КАК ДоговорПокупателяПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор) КАК РегистраторПредставление,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	ВложенныйЗапрос.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	ВложенныйЗапрос.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ВложенныйЗапрос.НДС КАК НДС,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
	|	ВложенныйЗапрос.ВаловаяПрибыль КАК ВаловаяПрибыль,
	|	ВложенныйЗапрос.Эффективность КАК Эффективность,
	|	ВложенныйЗапрос.Рентабельность КАК Рентабельность,
	|	ВложенныйЗапрос.ГрузополучательДляАдреса,
	|	ВложенныйЗапрос.АдресноеПоле
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоБазовыхЕдиниц,
	|	СтоимостьБезНДС,
	|	НДС,
	|	Стоимость,
	|	Себестоимость,
	|	ВаловаяПрибыль,
	|	Эффективность,
	|	Рентабельность,
	|	ГрузополучательДляАдреса,
	|	АдресноеПоле}
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Проект КАК Проект,
	|		ВложенныйЗапрос.Подразделение КАК Подразделение,
	|		ВложенныйЗапрос.Покупатель КАК Покупатель,
	|		ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ВложенныйЗапрос.Период КАК Период,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ПериодДень,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕКАДА) КАК ПериодДекада,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ) КАК ПериодМесяц,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, КВАРТАЛ) КАК ПериодКвартал,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ГОД) КАК ПериодГод,
	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|		СУММА(ВложенныйЗапрос.КоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	|		СУММА(ВложенныйЗапрос.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(ВЫБОР
	|				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|					ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|				ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|			КОНЕЦ * ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0)) КАК СтоимостьБезНДС,
	|		СУММА(ВЫБОР
	|				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|					ТОГДА ВложенныйЗапрос.НДС
	|				ИНАЧЕ ВложенныйЗапрос.НДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|			КОНЕЦ * ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0)) КАК НДС,
	|		СУММА(ВЫБОР
	|				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|					ТОГДА ВложенныйЗапрос.Стоимость
	|				ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|			КОНЕЦ * ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0)) КАК Стоимость,
	|		СУММА(ВложенныйЗапрос.Себестоимость * ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0)) КАК Себестоимость,
	|		ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА СУММА(ВЫБОР
	|							КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|								ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|							ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|						КОНЕЦ)
	|			ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|							ТОГДА ВложенныйЗапрос.Стоимость
	|						ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|					КОНЕЦ)
	|		КОНЕЦ - СУММА(ВложенныйЗапрос.Себестоимость) * ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0) КАК ВаловаяПрибыль,
	|		100 * ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА ВЫБОР
	|						КОГДА СУММА(ВложенныйЗапрос.Себестоимость) > 0
	|							ТОГДА (СУММА(ВЫБОР
	|										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|									КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Себестоимость) > 0
	|						ТОГДА (СУММА(ВЫБОР
	|									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|										ТОГДА ВложенныйЗапрос.Стоимость
	|									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|								КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК Эффективность,
	|		100 * ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА ВЫБОР
	|						КОГДА СУММА(ВЫБОР
	|									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|										ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|									ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|								КОНЕЦ) > 0
	|							ТОГДА (СУММА(ВЫБОР
	|										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|									КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВЫБОР
	|										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|									КОНЕЦ)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СУММА(ВЫБОР
	|								КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|									ТОГДА ВложенныйЗапрос.Стоимость
	|								ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|							КОНЕЦ) > 0
	|						ТОГДА (СУММА(ВЫБОР
	|									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|										ТОГДА ВложенныйЗапрос.Стоимость
	|									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|								КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВЫБОР
	|									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|										ТОГДА ВложенныйЗапрос.Стоимость
	|									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|								КОНЕЦ)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК Рентабельность,
	|		ВложенныйЗапрос.ГрузополучательДляАдреса КАК ГрузополучательДляАдреса,
	|		ВложенныйЗапрос.АдресноеПоле КАК АдресноеПоле
	|	{ВЫБРАТЬ
	|		Организация,
	|		Проект,
	|		Подразделение,
	|		Покупатель,
	|		ДоговорПокупателя,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Регистратор,
	|		Период,
	|		ПериодДень,
	|		ПериодНеделя,
	|		ПериодДекада,
	|		ПериодМесяц,
	|		ПериодКвартал,
	|		ПериодПолугодие,
	|		ПериодГод}
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПродажиОбороты.Проект КАК Проект,
	|			ПродажиОбороты.Подразделение КАК Подразделение,
	|			ПродажиОбороты.Контрагент КАК Покупатель,
	|			ПродажиОбороты.ДоговорКонтрагента КАК ДоговорПокупателя,
	|			ПродажиОбороты.Номенклатура КАК Номенклатура,
	|			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.Организация КАК Организация,
	|			ПродажиОбороты.Регистратор КАК Регистратор,
	|			ПродажиОбороты.Период КАК Период,
	|			ПродажиОбороты.КоличествоОборот КАК КоличествоПродажи,
	|			ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) КАК Количество,
	|			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК КоличествоЕдиницОтчетов,
	|			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) КАК КоличествоБазовыхЕдиниц,
	|			ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот КАК СтоимостьБезНДС,
	|			ПродажиОбороты.НДСОборот КАК НДС,
	|			ПродажиОбороты.СтоимостьОборот КАК Стоимость,
	|			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ЕСТЬNULL(ТаблСебестоимость.Себестоимость, 0) КАК Себестоимость,
	|			ВЫБОР
	|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Контрагент
	|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					ТОГДА ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Контрагент <> ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Грузополучатель
	|								ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Грузополучатель
	|							ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|						КОНЕЦ
	|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|					ТОГДА ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент <> ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Грузополучатель
	|								ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Грузополучатель
	|							ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|						КОНЕЦ
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			КОНЕЦ КАК ГрузополучательДляАдреса,
	|			ВЫБОР
	|				КОГДА КонтактнаяИнформация.Представление ЕСТЬ NULL
	|					ТОГДА """"
	|				ИНАЧЕ ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(1000))
	|			КОНЕЦ КАК АдресноеПоле
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|				ПО (ВЫБОР
	|						КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|							ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Контрагент
	|						КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|							ТОГДА ВЫБОР
	|									КОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Контрагент <> ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Грузополучатель
	|										ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Грузополучатель
	|									ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|								КОНЕЦ
	|						КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|							ТОГДА ВЫБОР
	|									КОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент <> ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Грузополучатель
	|										ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Грузополучатель
	|									ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|								КОНЕЦ
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					КОНЕЦ = КонтактнаяИнформация.Объект)
	|					И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|					И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ТоварыОтветственногоХраненияОбороты.Регистратор КАК Регистратор,
	|					ТоварыОтветственногоХраненияОбороты.Номенклатура КАК Номенклатура,
	|					ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ТоварыОтветственногоХраненияОбороты.Контрагент КАК Контрагент,
	|					ТоварыОтветственногоХраненияОбороты.КоличествоОборот * -1 КАК КоличествоОборот
	|				ИЗ
	|					РегистрНакопления.ТоварыОтветственногоХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Контрагент).* КАК Поставщик, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ТоварыОтветственногоХраненияОбороты
	|				ГДЕ
	|					ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) ЕСТЬ НЕ NULL 
	|				{ГДЕ
	|					ТоварыОтветственногоХраненияОбороты.Номенклатура.*,
	|					ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры.*}) КАК ТаблТОХ
	|				ПО ПродажиОбороты.Номенклатура = ТаблТОХ.Номенклатура
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблТОХ.ХарактеристикаНоменклатуры
	|					И ПродажиОбороты.Регистратор = ТаблТОХ.Регистратор
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|					ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ВложенныйЗапрос.Себестоимость КАК Себестоимость
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|						ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|						СУММА(ВЫБОР
	|								КОГДА ВложенныйЗапрос.КоличествоПриходНач = 0
	|									ТОГДА ОКР(ВложенныйЗапрос.СтоимостьПриходНач / 1, 2)
	|								ИНАЧЕ ОКР(ВложенныйЗапрос.СтоимостьПриходНач / ВложенныйЗапрос.КоличествоПриходНач, 2)
	|							КОНЕЦ) КАК Себестоимость
	|					ИЗ
	|						(ВЫБРАТЬ
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.Номенклатура
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.Номенклатура
	|							КОНЕЦ КАК Номенклатура,
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
	|							КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|							СУММА(ВЫБОР
	|									КОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.Количество, 0) = 0
	|										ТОГДА ПартииТоваровНаСкладахОбороты.ПродажиСебестоимостьКоличество
	|									ИНАЧЕ ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.Количество, 0)
	|								КОНЕЦ) КАК КоличествоПриходНач,
	|							СУММА(ВЫБОР
	|									КОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.Стоимость, 0) = 0
	|										ТОГДА ПартииТоваровНаСкладахОбороты.ПродажиСебестоимостьСтоимость
	|									ИНАЧЕ ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.Стоимость, 0)
	|								КОНЕЦ) КАК СтоимостьПриходНач
	|						ИЗ
	|							РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&ДатаНач, {(Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПартииТоваровНаСкладахОстатки
	|								ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|									ПартииТоваровНаСкладахОбороты.Номенклатура КАК Номенклатура,
	|									ПартииТоваровНаСкладахОбороты.Склад КАК Склад,
	|									ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|									ПартииТоваровНаСкладахОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
	|									ПартииТоваровНаСкладахОбороты.Качество КАК Качество,
	|									ПартииТоваровНаСкладахОбороты.ДокументОприходования КАК ДокументОприходования,
	|									ПартииТоваровНаСкладахОбороты.Заказ КАК Заказ,
	|									ПартииТоваровНаСкладахОбороты.СтатусПартии КАК СтатусПартии,
	|									СУММА(ВЫБОР
	|											КОГДА ПартииТоваровНаСкладахОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|												ТОГДА ВЫБОР
	|														КОГДА СписанныеТовары.ДокументПартии ЕСТЬ NULL
	|															ТОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.КоличествоПриход, 0)
	|														ИНАЧЕ ВЫБОР
	|																КОГДА НАЧАЛОПЕРИОДА(СписанныеТовары.ДокументПартии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СписанныеТовары.Регистратор.Дата, МЕСЯЦ)
	|																	ТОГДА -1 * ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.КоличествоРасход, 0)
	|																ИНАЧЕ ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.КоличествоПриход, 0)
	|															КОНЕЦ
	|													КОНЕЦ
	|											ИНАЧЕ ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.КоличествоПриход, 0)
	|										КОНЕЦ) КАК Количество,
	|									СУММА(ВЫБОР
	|											КОГДА ПартииТоваровНаСкладахОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|												ТОГДА ВЫБОР
	|														КОГДА СписанныеТовары.ДокументПартии ЕСТЬ NULL
	|															ТОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.СтоимостьПриход, 0)
	|														ИНАЧЕ ВЫБОР
	|																КОГДА НАЧАЛОПЕРИОДА(СписанныеТовары.ДокументПартии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СписанныеТовары.Регистратор.Дата, МЕСЯЦ)
	|																	ТОГДА -1 * ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.СтоимостьРасход, 0)
	|																ИНАЧЕ ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.СтоимостьПриход, 0)
	|															КОНЕЦ
	|													КОНЕЦ
	|											ИНАЧЕ ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.СтоимостьПриход, 0)
	|										КОНЕЦ) КАК Стоимость,
	|									СУММА(ЕСТЬNULL(ПродажиСебестоимостьОбороты.КоличествоОборот, 0)) КАК ПродажиСебестоимостьКоличество,
	|									СУММА(ЕСТЬNULL(ПродажиСебестоимостьОбороты.СтоимостьОборот, 0)) КАК ПродажиСебестоимостьСтоимость
	|								ИЗ
	|									РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПартииТоваровНаСкладахОбороты
	|										ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|											СписанныеТовары.Регистратор КАК Регистратор,
	|											МАКСИМУМ(СписанныеТовары.ДокументПартии) КАК ДокументПартии,
	|											СписанныеТовары.Качество КАК Качество,
	|											СписанныеТовары.Номенклатура КАК Номенклатура,
	|											СписанныеТовары.Склад КАК Склад,
	|											СписанныеТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|											СписанныеТовары.СерияНоменклатуры КАК СерияНоменклатуры
	|										ИЗ
	|											РегистрСведений.СписанныеТовары КАК СписанныеТовары
	|										ГДЕ
	|											СписанныеТовары.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|											И СписанныеТовары.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|										{ГДЕ
	|											СписанныеТовары.Номенклатура.*,
	|											СписанныеТовары.ХарактеристикаНоменклатуры.*}
	|										
	|										СГРУППИРОВАТЬ ПО
	|											СписанныеТовары.Регистратор,
	|											СписанныеТовары.Качество,
	|											СписанныеТовары.Номенклатура,
	|											СписанныеТовары.Склад,
	|											СписанныеТовары.ХарактеристикаНоменклатуры,
	|											СписанныеТовары.СерияНоменклатуры) КАК СписанныеТовары
	|										ПО ПартииТоваровНаСкладахОбороты.Регистратор = СписанныеТовары.Регистратор
	|											И ПартииТоваровНаСкладахОбороты.Номенклатура = СписанныеТовары.Номенклатура
	|											И ПартииТоваровНаСкладахОбороты.Качество = СписанныеТовары.Качество
	|											И ПартииТоваровНаСкладахОбороты.Склад = СписанныеТовары.Склад
	|											И ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры = СписанныеТовары.ХарактеристикаНоменклатуры
	|											И ПартииТоваровНаСкладахОбороты.СерияНоменклатуры = СписанныеТовары.СерияНоменклатуры
	|										ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК ПродажиСебестоимостьОбороты
	|										ПО ПартииТоваровНаСкладахОбороты.Номенклатура = ПродажиСебестоимостьОбороты.Номенклатура
	|											И ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры = ПродажиСебестоимостьОбороты.ХарактеристикаНоменклатуры
	|											И ПартииТоваровНаСкладахОбороты.Регистратор = ПродажиСебестоимостьОбороты.Регистратор
	|											И ПартииТоваровНаСкладахОбороты.ДокументОприходования = ПродажиСебестоимостьОбороты.ДокументОприходования
	|								
	|								СГРУППИРОВАТЬ ПО
	|									ПартииТоваровНаСкладахОбороты.Номенклатура,
	|									ПартииТоваровНаСкладахОбороты.Склад,
	|									ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры,
	|									ПартииТоваровНаСкладахОбороты.СерияНоменклатуры,
	|									ПартииТоваровНаСкладахОбороты.Качество,
	|									ПартииТоваровНаСкладахОбороты.ДокументОприходования,
	|									ПартииТоваровНаСкладахОбороты.Заказ,
	|									ПартииТоваровНаСкладахОбороты.СтатусПартии) КАК ПартииТоваровНаСкладахОбороты
	|								ПО ПартииТоваровНаСкладахОстатки.Номенклатура = ПартииТоваровНаСкладахОбороты.Номенклатура
	|									И ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|									И ПартииТоваровНаСкладахОстатки.ДокументОприходования = ПартииТоваровНаСкладахОбороты.ДокументОприходования
	|									И ПартииТоваровНаСкладахОстатки.Заказ = ПартииТоваровНаСкладахОбороты.Заказ
	|									И ПартииТоваровНаСкладахОстатки.Склад = ПартииТоваровНаСкладахОбороты.Склад
	|									И ПартииТоваровНаСкладахОстатки.СерияНоменклатуры = ПартииТоваровНаСкладахОбороты.СерияНоменклатуры
	|									И ПартииТоваровНаСкладахОстатки.СтатусПартии = ПартииТоваровНаСкладахОбороты.СтатусПартии
	|									И ПартииТоваровНаСкладахОстатки.Качество = ПартииТоваровНаСкладахОбороты.Качество
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.Номенклатура
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.Номенклатура
	|							КОНЕЦ,
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
	|							КОНЕЦ) КАК ВложенныйЗапрос
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ВложенныйЗапрос.Номенклатура,
	|						ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос) КАК ТаблСебестоимость
	|				ПО ПродажиОбороты.Номенклатура = ТаблСебестоимость.Номенклатура
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблСебестоимость.ХарактеристикаНоменклатуры
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ПродажиОбороты.Проект,
	|			ПродажиОбороты.Подразделение,
	|			ПродажиОбороты.Контрагент,
	|			ПродажиОбороты.ДоговорКонтрагента,
	|			ПродажиОбороты.Номенклатура,
	|			ПродажиОбороты.ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.Организация,
	|			ПродажиОбороты.Регистратор,
	|			ПродажиОбороты.Период,
	|			ПродажиОбороты.КоличествоОборот,
	|			ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0),
	|			ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1),
	|			ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1),
	|			ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот,
	|			ПродажиОбороты.НДСОборот,
	|			ПродажиОбороты.СтоимостьОборот,
	|			ЕСТЬNULL(ТаблТОХ.СебестоимостьТОХ, 0),
	|			ВЫБОР
	|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Контрагент
	|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					ТОГДА ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Контрагент <> ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Грузополучатель
	|								ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Грузополучатель
	|							ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|						КОНЕЦ
	|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|					ТОГДА ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент <> ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Грузополучатель
	|								ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Грузополучатель
	|							ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|						КОНЕЦ
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА КонтактнаяИнформация.Представление ЕСТЬ NULL
	|					ТОГДА """"
	|				ИНАЧЕ ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(1000))
	|			КОНЕЦ
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаН}) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|				ПО (ВЫБОР
	|						КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|							ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ВозвратТоваровОтПокупателя).Контрагент
	|						КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|							ТОГДА ВЫБОР
	|									КОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Контрагент <> ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Грузополучатель
	|										ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Грузополучатель
	|									ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|								КОНЕЦ
	|						КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|							ТОГДА ВЫБОР
	|									КОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент <> ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Грузополучатель
	|										ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Грузополучатель
	|									ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|								КОНЕЦ
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					КОНЕЦ = КонтактнаяИнформация.Объект)
	|					И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|					И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВложенныйЗапрос.Регистратор КАК Регистратор,
	|					ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|					ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ВложенныйЗапрос.Контрагент КАК Контрагент,
	|					ВложенныйЗапрос.КоличествоОборот КАК КоличествоОборот,
	|					ЕСТЬNULL(ВложенныйЗапросЦен.Цена, 0) * ВложенныйЗапрос.КоличествоОборот КАК СебестоимостьТОХ
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ТоварыОтветственногоХраненияОбороты.Регистратор КАК Регистратор,
	|						ТоварыОтветственногоХраненияОбороты.Номенклатура КАК Номенклатура,
	|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|						ТоварыОтветственногоХраненияОбороты.Контрагент КАК Контрагент,
	|						МАКСИМУМ(ТоварыОтветственногоХраненияОбороты.КоличествоОборот * -1) КАК КоличествоОборот,
	|						ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен КАК ТипЦен,
	|						МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Период) КАК ПериодЦены
	|					ИЗ
	|						РегистрНакопления.ТоварыОтветственногоХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Контрагент).* КАК Поставщик, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ТоварыОтветственногоХраненияОбороты
	|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
	|							ПО ТоварыОтветственногоХраненияОбороты.Номенклатура = ЦеныНоменклатурыКонтрагентов.Номенклатура
	|								И ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен = ЦеныНоменклатурыКонтрагентов.ТипЦен
	|								И ТоварыОтветственногоХраненияОбороты.Период >= ЦеныНоменклатурыКонтрагентов.Период
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ТоварыОтветственногоХраненияОбороты.Регистратор,
	|						ТоварыОтветственногоХраненияОбороты.Номенклатура,
	|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры,
	|						ТоварыОтветственногоХраненияОбороты.Контрагент,
	|						ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен) КАК ВложенныйЗапрос
	|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|							ЦеныНоменклатурыКонтрагентов.Период КАК Период,
	|							ЦеныНоменклатурыКонтрагентов.Номенклатура КАК Номенклатура,
	|							ЦеныНоменклатурыКонтрагентов.ТипЦен КАК ТипЦен,
	|							МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Цена) КАК Цена
	|						ИЗ
	|							РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ЦеныНоменклатурыКонтрагентов.Период,
	|							ЦеныНоменклатурыКонтрагентов.Номенклатура,
	|							ЦеныНоменклатурыКонтрагентов.ТипЦен) КАК ВложенныйЗапросЦен
	|						ПО ВложенныйЗапрос.ПериодЦены = ВложенныйЗапросЦен.Период
	|							И ВложенныйЗапрос.Номенклатура = ВложенныйЗапросЦен.Номенклатура
	|							И ВложенныйЗапрос.ТипЦен = ВложенныйЗапросЦен.ТипЦен) КАК ТаблТОХ
	|				ПО ПродажиОбороты.Номенклатура = ТаблТОХ.Номенклатура
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблТОХ.ХарактеристикаНоменклатуры
	|					И ПродажиОбороты.Регистратор = ТаблТОХ.Регистратор) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ПродажиОбороты.Номенклатура КАК Номенклатура,
	|				ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|				ПродажиОбороты.Регистратор КАК Регистратор,
	|				МИНИМУМ(ВложенныйЗапрос.КурсВалютыУпрУчета * ВложенныйЗапрос.КратностьВалютыПересчета / ВложенныйЗапрос.КурсВалютыПересчета * ВложенныйЗапрос.КратностьВалютыУпрУчета) КАК Коэффициент
	|			ИЗ
	|				РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПродажиОбороты
	|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						ВложенныйЗапрос.Регистратор КАК Регистратор,
	|						КурсыВалютУпрУчета.Курс КАК КурсВалютыУпрУчета,
	|						КурсыВалютУпрУчета.Кратность КАК КратностьВалютыУпрУчета,
	|						КурсыВалютПересчета.Курс КАК КурсВалютыПересчета,
	|						КурсыВалютПересчета.Кратность КАК КратностьВалютыПересчета
	|					ИЗ
	|						(ВЫБРАТЬ
	|							ПродажиОбороты.Регистратор КАК Регистратор,
	|							МАКСИМУМ(КурсыВалютПересчета.Период) КАК ПериодВалютПересчета,
	|							МАКСИМУМ(КурсыВалютУпрУчета.Период) КАК ПериодВалютУпрУчета
	|						ИЗ
	|							РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПродажиОбороты
	|								ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютУпрУчета
	|								ПО ПродажиОбороты.Регистратор.Дата >= КурсыВалютУпрУчета.Период
	|									И (КурсыВалютУпрУчета.Валюта = &ВалютаУпрУчета)
	|								ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютПересчета
	|								ПО ПродажиОбороты.Регистратор.Дата >= КурсыВалютПересчета.Период
	|									И (КурсыВалютПересчета.Валюта = &ВалютаПересчета)
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ПродажиОбороты.Регистратор) КАК ВложенныйЗапрос
	|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютУпрУчета
	|							ПО ВложенныйЗапрос.ПериодВалютУпрУчета = КурсыВалютУпрУчета.Период
	|								И (КурсыВалютУпрУчета.Валюта = &ВалютаУпрУчета)
	|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютПересчета
	|							ПО ВложенныйЗапрос.ПериодВалютПересчета = КурсыВалютПересчета.Период
	|								И (КурсыВалютПересчета.Валюта = &ВалютаПересчета)) КАК ВложенныйЗапрос
	|					ПО ПродажиОбороты.Регистратор = ВложенныйЗапрос.Регистратор
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ПродажиОбороты.Номенклатура,
	|				ПродажиОбороты.ХарактеристикаНоменклатуры,
	|				ПродажиОбороты.Регистратор) КАК ТаблицаРегистраПродажиОборотыКоэффициенты
	|			ПО ВложенныйЗапрос.Номенклатура = ТаблицаРегистраПродажиОборотыКоэффициенты.Номенклатура
	|				И ВложенныйЗапрос.ХарактеристикаНоменклатуры = ТаблицаРегистраПродажиОборотыКоэффициенты.ХарактеристикаНоменклатуры
	|				И ВложенныйЗапрос.Регистратор = ТаблицаРегистраПродажиОборотыКоэффициенты.Регистратор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Проект,
	|		ВложенныйЗапрос.Подразделение,
	|		ВложенныйЗапрос.Покупатель,
	|		ВложенныйЗапрос.ДоговорПокупателя,
	|		ВложенныйЗапрос.Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.Регистратор,
	|		ВложенныйЗапрос.Период,
	|		ВложенныйЗапрос.ГрузополучательДляАдреса,
	|		ВложенныйЗапрос.АдресноеПоле,
	|		ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ВложенныйЗапрос.Количество) <> 0
	|			ИЛИ СУММА(ВложенныйЗапрос.Стоимость) <> 0
	|			ИЛИ СУММА(ЕСТЬNULL(ВложенныйЗапрос.Себестоимость, 0)) <> 0)) КАК ВложенныйЗапрос
	|{ГДЕ
	|	ВложенныйЗапрос.Регистратор.*,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.КоличествоЕдиницОтчетов,
	|	ВложенныйЗапрос.КоличествоБазовыхЕдиниц,
	|	ВложенныйЗапрос.СтоимостьБезНДС,
	|	ВложенныйЗапрос.НДС,
	|	ВложенныйЗапрос.Стоимость,
	|	ВложенныйЗапрос.Себестоимость,
	|	ВложенныйЗапрос.ВаловаяПрибыль,
	|	ВложенныйЗапрос.Эффективность,
	|	ВложенныйЗапрос.Рентабельность}
	|{УПОРЯДОЧИТЬ ПО
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоБазовыхЕдиниц,
	|	СтоимостьБезНДС,
	|	НДС,
	|	Стоимость,
	|	Себестоимость,
	|	ВаловаяПрибыль,
	|	Эффективность,
	|	Рентабельность}
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоЕдиницОтчетов),
	|	СУММА(КоличествоБазовыхЕдиниц),
	|	СУММА(СтоимостьБезНДС),
	|	СУММА(НДС),
	|	СУММА(Стоимость),
	|	СУММА(Себестоимость),
	|	ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА СУММА(СтоимостьБезНДС)
	|		ИНАЧЕ СУММА(Стоимость)
	|	КОНЕЦ - СУММА(Себестоимость) КАК ВаловаяПрибыль,
	|	100 * ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(Себестоимость) <> 0
	|						ТОГДА (СУММА(СтоимостьБезНДС) - СУММА(Себестоимость)) / СУММА(Себестоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(Себестоимость) <> 0
	|					ТОГДА (СУММА(Стоимость) - СУММА(Себестоимость)) / СУММА(Себестоимость)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Эффективность,
	|	100 * ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(СтоимостьБезНДС) <> 0
	|						ТОГДА (СУММА(СтоимостьБезНДС) - СУММА(Себестоимость)) / СУММА(СтоимостьБезНДС)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(Стоимость) <> 0
	|					ТОГДА (СУММА(Стоимость) - СУММА(Себестоимость)) / СУММА(Стоимость)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Рентабельность
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	ГрузополучательДляАдреса.*,
	|	АдресноеПоле}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Покупатель", "Покупатель", "Покупатель", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ДоговорПокупателя", "ДоговорПокупателя", "Договор покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры", "Характеристика номенклатуры", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя", "ЗаказПокупателя", "Заказ покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя", "ЗаказПокупателя", "Заказ покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документ_ЗаказПокупателя);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
	
	//Добавлено wildhog
	//Исправляем текст запроса для расчета показателей по курсу требуемой валюты.
	//ИсправитьТекстЗапросаДляРасчетаУправленческойСебестоимостиИВознаграждений(ТекстЗапроса);
	//Окончание) wildhog
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация", "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Проект", "Проект");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Покупатель", "Покупатель");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорПокупателя", "Договор покупателя");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Номенклатура", "Номенклатура");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры", "Характеристика номенклатуры");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЗаказПокупателя", "Заказ покупателя");
	//Макарова
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("АдресноеПоле", "Адрес доставки");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ГрузополучательДляАдреса", "Грузополучатель");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", "Количество (ед. хранения)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоЕдиницОтчетов", "Количество (ед. отчетов)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоБазовыхЕдиниц", "Количество (базовых ед.)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьБезНДС", "Стоимость продажи без НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДС", "НДС продажи");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Стоимость", "Стоимость продажи с НДС");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Себестоимость", "Себестоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВаловаяПрибыль", "Валовая прибыль");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Эффективность", "Эффективность, %");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Рентабельность", "Рентабельность, %");

	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета");
	
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("Количество", "Ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдиниц", "Базовых ед.", Ложь, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетов", "Ед. отчетов", Ложь, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьБезНДС", "Без НДС", Истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи", "Стоимость продажи (" + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("НДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи");
	УниверсальныйОтчет.ДобавитьПоказатель("Стоимость", "С НДС", Истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Себестоимость", "Себестоимость  (" + ВалютаУпр + ")", Ложь, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("ВаловаяПрибыль", "Валовая прибыль (" + ВалютаУпр + ")", Истина, "ЧЦ=15; ЧДЦ=2");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Эффективность", "Эффективность, %", Ложь, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("Рентабельность", "Рентабельность, %", Истина, "ЧЦ=15; ЧДЦ=2");

	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Покупатель");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("Покупатель");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	//Добавлено wildhog
	Если НЕ ЗначениеЗаполнено(ВалютаПересчета) Тогда
		ВалютаПересчета = глЗначениеПеременной("ВалютаУправленческогоУчета");
	КонецЕсли;	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВалютаПересчета", ВалютаПересчета);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВалютаУпрУчета", Константы.ВалютаУправленческогоУчета.Получить());
	Если ВалютаТекущая <> ВалютаПересчета Тогда
		ИсправитьПредставлениеПоказателейУниверсальногоОтчета(УниверсальныйОтчет.Показатели.Строки);
		ВалютаТекущая = ВалютаПересчета;
	КонецЕсли;	
	//Окончание) wildhog
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	Отказ = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(?(Не ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон), ТекущаяДата(), УниверсальныйОтчет.ДатаКон), Отказ);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НеВключатьНДСВСтоимостьПартий", ?(Отказ, Ложь, УчетнаяПолитика.НеВключатьНДСВСтоимостьПартий));
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

//Добавлено wildhog
Процедура ИсправитьТекстЗапросаДляРасчетаУправленческойСебестоимостиИВознаграждений(ТекстЗапроса);
	//Исправляем старые описания полей
	СтрокаПоиска = "(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ЕСТЬNULL(ТаблСебестоимость.Себестоимость, 0) КАК Себестоимость";
	СтрокаЗамены = " (ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ЕСТЬNULL(ТаблСебестоимость.Себестоимость, 0) * ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0) КАК Себестоимость";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);
    
	СтрокаПоиска = "ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот КАК СтоимостьБезНДС,";
	СтрокаЗамены = "(ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот )* ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0) КАК СтоимостьБезНДС,";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);
	
	СтрокаПоиска = "ПродажиОбороты.НДСОборот КАК НДС,";
	СтрокаЗамены = "ПродажиОбороты.НДСОборот * ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0) КАК НДС,";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);
	
	СтрокаПоиска = "ПродажиОбороты.СтоимостьОборот КАК Стоимость,";
	СтрокаЗамены = "ПродажиОбороты.СтоимостьОборот * ЕСТЬNULL(ТаблицаРегистраПродажиОборотыКоэффициенты.Коэффициент, 0) КАК Стоимость,";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);
	
	// Добавляем подзапрос для расчет управленческой себестоимости.
	СтрокаПоиска = "//ЗапросДляРасчетаСебестоимостиПоКурсуДокументаПродажи";
	СтрокаЗамены = "	
|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|					ПродажиОбороты.Номенклатура КАК Номенклатура,
|					ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
|					ПродажиОбороты.Регистратор КАК Регистратор,
|					МИНИМУМ(ВложенныйЗапрос.КурсВалютыУпрУчета * ВложенныйЗапрос.КратностьВалютыПересчета / ВложенныйЗапрос.КурсВалютыПересчета * ВложенныйЗапрос.КратностьВалютыУпрУчета) КАК Коэффициент
|				ИЗ
|					РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПродажиОбороты
|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|							ВложенныйЗапрос.Регистратор КАК Регистратор,
|							КурсыВалютУпрУчета.Курс КАК КурсВалютыУпрУчета,
|							КурсыВалютУпрУчета.Кратность КАК КратностьВалютыУпрУчета,
|							КурсыВалютПересчета.Курс КАК КурсВалютыПересчета,
|							КурсыВалютПересчета.Кратность КАК КратностьВалютыПересчета
|						ИЗ
|							(ВЫБРАТЬ
|								ПродажиОбороты.Регистратор КАК Регистратор,
|								МАКСИМУМ(КурсыВалютУпрУчета.Период) КАК ПериодВалютУпрУчета,
|								МАКСИМУМ(КурсыВалютПересчета.Период) КАК ПериодВалютПересчета
|							ИЗ
|								РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПродажиОбороты
|									ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютУпрУчета
|									ПО ПродажиОбороты.Регистратор.Дата >= КурсыВалютУпрУчета.Период
|										И (КурсыВалютУпрУчета.Валюта = &ВалютаУпрУчета)
|									ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютПересчета
|									ПО ПродажиОбороты.Регистратор.Дата >= КурсыВалютПересчета.Период
|										И (КурсыВалютПересчета.Валюта = &ВалютаПересчета)
|							
|							СГРУППИРОВАТЬ ПО
|								ПродажиОбороты.Регистратор) КАК ВложенныйЗапрос
|								ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютУпрУчета
|								ПО ВложенныйЗапрос.ПериодВалютУпрУчета = КурсыВалютУпрУчета.Период
|									И (КурсыВалютУпрУчета.Валюта = &ВалютаУпрУчета)
|								ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютПересчета
|								ПО ВложенныйЗапрос.ПериодВалютПересчета = КурсыВалютПересчета.Период
|									И (КурсыВалютПересчета.Валюта = &ВалютаПересчета)) КАК ВложенныйЗапрос
|						ПО ПродажиОбороты.Регистратор = ВложенныйЗапрос.Регистратор
|				
|				СГРУППИРОВАТЬ ПО
|					ПродажиОбороты.Номенклатура,
|					ПродажиОбороты.ХарактеристикаНоменклатуры,
|					ПродажиОбороты.Регистратор) КАК ТаблицаРегистраПродажиОборотыКоэффициенты
|				ПО ПродажиОбороты.Номенклатура = ТаблицаРегистраПродажиОборотыКоэффициенты.Номенклатура
|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблицаРегистраПродажиОборотыКоэффициенты.ХарактеристикаНоменклатуры
|					И ПродажиОбороты.Регистратор = ТаблицаРегистраПродажиОборотыКоэффициенты.Регистратор";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);	
КонецПроцедуры	

Процедура ИсправитьПредставлениеПоказателейУниверсальногоОтчета(ДеревоПоказателей) 
	Для каждого СтрокаДерева Из ДеревоПоказателей Цикл
 		СтрокаДерева.Представление = СтрЗаменить(СтрокаДерева.Представление, ВалютаТекущая.Наименование, ВалютаПересчета.Наименование);	
		СтрокаДерева.ПредставлениеВОтчете = СтрЗаменить(СтрокаДерева.ПредставлениеВОтчете, ВалютаТекущая.Наименование, ВалютаПересчета.Наименование);
        ИсправитьПредставлениеПоказателейУниверсальногоОтчета(СтрокаДерева.Строки);
 	КонецЦикла;	
КонецПроцедуры 

ВалютаТекущая = глЗначениеПеременной("ВалютаУправленческогоУчета");
//Окончание) wildhog

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
